// --------------------------------------------------------------------------------------------------------------------
// namespace
// --------------------------------------------------------------------------------------------------------------------
namespace ARuSonarQubeSample.Rules.S3949
{
    // --------------------------------------------------------------------------------------------------------------------
    // classes
    // --------------------------------------------------------------------------------------------------------------------

    /// <summary>
    /// Calculations should not overflow
    /// </summary>
    /// <remarks>
    /// <para>数値型のオーバーフロー、アンダーフローのチェックを行います。</para>
    /// </remarks>
    public class RuleS3949
    {
        // --------------------------------------------------------------------------------------------------------------------
        // methods
        // --------------------------------------------------------------------------------------------------------------------

        /// <summary>
        /// 非準拠コード(S3949)
        /// </summary>
        /// <remarks>
        /// <para>本例ではint.MaxValueに1を加算することで、オーバーフローを発生させています。</para>
        /// </remarks>
        public int NoncompliantCodeS3949()
        {
            int num = int.MaxValue;
            return num + 1;
        }

        /// <summary>
        /// 準拠コード(S3949)
        /// </summary>
        /// <remarks>
        /// <para>オーバーフローが発生していない例です。</para>
        /// </remarks>
        public int CompliantCodeS3949()
        {
            int num = int.MaxValue - 1;
            return num + 1;
        }
    }
}
